一年内工作学习计划：
	在接下来的一年内，充满挑战，我将对与工作需要的知识加强学习，我最感兴趣的主要是驱动方面的
知识，我想继续学习各种驱动的写法，包括操作系统与linux内核机制的学习；其次是对系统移植方面的
学习,bootloader的移植，kernel的编译配置，文件系统的搭建；然后是一些应用和脚本的写法。同时，
我也会继续对C语言算法和数据结构、java语言的学习。

1.驱动学习: 学习 按键驱动 UART IIC 网络 音频 LCD FLASH USB 驱动
	--->:7  按键驱动
	--->:8	LCD驱动
	--->:9	触摸屏驱动
	--->:10 USB驱动
	--->:11 NANDFLASH驱动
	--->:12 网卡驱动
	--->:1  IIC驱动
	--->:2  音频驱动
	由于对工作方面所需的具体驱动知识不太了解，如果工作所需，我会
首先考虑到工作方面的驱动，然后计划可以变更。


2.操作系统和linux内核机制: 理解计算机原理和内核各种常用机制
	每月完成两个内核机制和两章操作系统原理的学习
	



3.系统移植:uboot 内核移植 文件系统
	
	--->uboot:7~8
	
	--->kernel:9

	--->文件系统:10




4.linux应用编成、脚本的写法:
	配合驱动学习应用编成，参考UNIX高级环境编程每月两章。脚本每周抽出
	半天学习。



5.C语言算法、数据结构练习

	每个月进行一个算法或数据结构的实现




6.Java的学习：
	每周一章java疯狂讲义，代码敲一遍。



